app/views/market_period_names/_new_edit.html.erb

SELECT "markets".* FROM "markets"
---
		<%= f.label 'Market' %><br />
		<%= f.collection_select(:market_id, Market.all, :id, :name) %>

SELECT "period_quotation_types".* FROM "period_quotation_types"
---
		<%= f.label 'Period quotation type' %><br />
		<%= f.collection_select(:period_quotation_type_id, PeriodQuotationType.all, :id, :short_name) %>