app/views/quotations/index.html.erb

			<%= f.label 'Market' %><br />
			<%= f.collection_select(:market_id, Market.all, :id, :name, include_blank: true) %>
---
SELECT "markets".* FROM "markets"

			<%= f.label 'Currency pair' %><br />
			<%= f.collection_select(:currency_pair_id, CurrencyPair.all, :id, :name, include_blank: true) %>
---
SELECT DISTINCT "currency_pairs"."id" FROM "currency_pairs"

			<%= f.label 'Period quotation type' %><br />
			<%= f.collection_select(:period_quotation_type_id, PeriodQuotationType.all, :id, :short_name) %>
---
SELECT  "period_quotation_types".* FROM "period_quotation_types" WHERE "period_quotation_types"."short_name" = ? ORDER BY "period_quotation_types"."id" ASC LIMIT ?  [["short_name", "D1"], ["LIMIT", 1]]