app/views/period_quotation_types/_new_edit.html.erb

SELECT "time_intervals".* FROM "time_intervals"
---
		<%= f.label 'Time interval' %><br />
		<%= f.collection_select(:time_interval_id, TimeInterval.all, :id, :name) %>