app/controllers/currencies_controller.rb

  def index
    @currencies = Currency.all
---
SELECT "currencies".* FROM "currencies"