app/controllers/market_period_names_controller.rb

  def index
    @market_period_names = MarketPeriodName.all
---
SELECT "market_period_names".* FROM "market_period_names"

  def show
    @market_period_name = MarketPeriodName.find(params[:id])
---
SELECT  "market_period_names".* FROM "market_period_names" WHERE "market_period_names"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def create
    @market_period_name = MarketPeriodName.new(market_period_name_params)

    if @market_period_name.save
---
INSERT INTO "market_period_names" ("market_id", "period_quotation_type_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["market_id", 2], ["period_quotation_type_id", 11], ["name", "3h"], ["created_at", "2018-08-11 15:16:42.174843"], ["updated_at", "2018-08-11 15:16:42.174843"]]