app/controllers/market_symbol_precisions_controller.rb

  def index
    @market_symbol_precisions = MarketSymbolPrecision.all
---
SELECT "market_symbol_precisions".* FROM "market_symbol_precisions"