app/controllers/period_quotation_types_controller.rb

  def index
    @period_quotation_types = PeriodQuotationType.all
---
SELECT "period_quotation_types".* FROM "period_quotation_types"

  def show
    @period_quotation_type = PeriodQuotationType.find(params[:id])
---
SELECT  "period_quotation_types".* FROM "period_quotation_types" WHERE "period_quotation_types"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def create
    @period_quotation_type = PeriodQuotationType.new(period_quotation_type_params)

    if @period_quotation_type.save
---
INSERT INTO "period_quotation_types" ("short_name", "long_name", "time_interval_id", "count_intervals") VALUES (?, ?, ?, ?)  [["short_name", "H3"], ["long_name", "3 hours"], ["time_interval_id", 3], ["count_intervals", 3]]