app/controllers/quotations_controller.rb

  def index

    if params[:quotation].nil?
      @quotation = Quotation.new
      @quotation.period_quotation_type_id = PeriodQuotationType.where(short_name: 'D1').first.id
---
SELECT  "period_quotation_types".* FROM "period_quotation_types" WHERE "period_quotation_types"."short_name" = ? ORDER BY "period_quotation_types"."id" ASC LIMIT ?  [["short_name", "D1"], ["LIMIT", 1]]